Repository: ben456789/digi-guess-head-2-head
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, ja, pt

# appTitle
source: Head 2 Head Guessing Game
de: Head 2 Head Ratespiel
es: Juego de Adivinanzas Head 2 Head
fr: Jeu de Devinettes Head 2 Head
hi: Head 2 Head अनुमान लगाने का खेल
id: Permainan Tebak Head 2 Head
ja: Head 2 Head 推測ゲーム
pt: Jogo de Adivinhação Head 2 Head

# gameDescription
source: Guess which Digi character your opponent has chosen before they guess yours!
de: Errate, welchen Digi-Charakter dein Gegner gewählt hat, bevor er deinen errät!
es: ¡Adivina qué personaje Digi ha elegido tu oponente antes de que adivine el tuyo!
fr: Devinez quel personnage Digi votre adversaire a choisi avant qu'il ne devine le vôtre !
hi: अपने प्रतिद्वंद्वी से पहले अनुमान लगाएं कि उसने कौन सा डिजी-चरित्र चुना है!
id: Tebak karakter Digi yang dipilih lawanmu sebelum dia menebak milikmu!
ja: 相手があなたのキャラクターを推測する前に、相手が選んだデジキャラを推測しよう！
pt: Adivinhe qual personagem Digi seu oponente escolheu antes que ele adivinhe o seu!

source: Create Game
de: Spiel Erstellen
es: Crear Juego
fr: Créer une Partie
hi: खेल बनाएं
id: Buat Permainan
ja: ゲームを作成
pt: Criar Jogo

source: Join Game
de: Spiel Beitreten
es: Unirse al Juego
fr: Rejoindre une Partie
hi: खेल में शामिल हों
id: Gabung Permainan
ja: ゲームに参加
pt: Entrar no Jogo

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
id: Pengaturan
ja: 設定
pt: Configurações

source: How to Play
de: Spielanleitung
es: Cómo Jugar
fr: Comment Jouer
hi: कैसे खेलें
id: Cara Bermain
ja: 遊び方
pt: Como Jogar

source: Legal & Terms
de: Rechtliches
es: Legal y Términos
fr: Mentions Légales
hi: कानूनी शर्तें
id: Ketentuan Hukum
ja: 法的情報
pt: Termos Legais

source: Close
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करें
id: Tutup
ja: 閉じる
pt: Fechar

source: Your name
de: Dein Name
es: Tu nombre
fr: Votre nom
hi: आपका नाम
id: Nama Anda
ja: あなたの名前
pt: Seu Nome

# selectGenerations
source: Select Levels for the game
de: Wähle Level für das Spiel
es: Selecciona Niveles para el juego
fr: Sélectionnez les Niveaux pour le jeu
hi: खेल के लिए स्तरों का चयन करें
id: Pilih level untuk permainan
ja: ゲーム用のレベルを選択
pt: Selecione os níveis para o jogo

source: Number of Characters
de: Anzahl der Charaktere
es: Número de Personajes
fr: Nombre de Personnages
hi: पात्रों की संख्या
id: Jumlah Karakter
ja: キャラクター数
pt: Número de Personagens

# generating
source: Creating...
de: Erstelle...
es: Creando...
fr: Création...
hi: बना रहे हैं...
id: Membuat...
ja: 作成中...
pt: Gerando...

source: Generate Code & QR
de: Code & QR Generieren
es: Generar Código y QR
fr: Générer le Code et QR
hi: कोड और QR बनाएं
id: Buat Kode & QR
ja: コードとQRを生成
pt: Gerar Código e QR

# waitingForPlayer
source: Waiting for another player to scan QR or enter code...
de: Warte darauf, dass ein anderer Spieler den QR-Code scannt oder den Code eingibt...
es: Esperando a que otro jugador escanee el QR o ingrese el código...
fr: En attente qu'un autre joueur scanne le QR ou entre le code...
hi: किसी अन्य खिलाड़ी के QR कोड स्कैन करने या कोड दर्ज करने की प्रतीक्षा में...
id: Menunggu pemain lain memindai kode QR atau memasukkan kode...
ja: 他のプレイヤーがQRをスキャンまたはコードを入力するのを待っています...
pt: Aguardando outro jogador escanear o código QR ou digitar o código...

# gameCodeLabel
source: Game Code
de: Spielcode
es: Código del Juego
fr: Code de Jeu
hi: खेल कोड
id: Kode Permainan
ja: ゲームコード
pt: Código do Jogo

# orScanQR
source: Or scan this QR code
de: Oder scanne diesen QR-Code
es: O escanea este código QR
fr: Ou scannez ce code QR
hi: या इस QR कोड को स्कैन करें
id: Atau pindai kode QR ini
ja: またはこのQRコードをスキャン
pt: Ou escaneie este código QR

source: Go to Lobby
de: Zur Lobby
es: Ir al Lobby
fr: Aller au Lobby
hi: लॉबी में जाएं
id: Ke Lobi
ja: ロビーへ
pt: Ir para o Lobby

# pleaseEnterName
source: Please enter your name.
de: Bitte gib deinen Namen ein.
es: Por favor ingresa tu nombre.
fr: Veuillez entrer votre nom.
hi: कृपया अपना नाम दर्ज करें।
id: Silakan masukkan nama Anda.
ja: 名前を入力してください。
pt: Por favor, insira seu nome.

# pleaseSelectGeneration
source: Please select at least one level.
de: Bitte wähle mindestens ein Level.
es: Por favor selecciona al menos un nivel.
fr: Veuillez sélectionner au moins un niveau.
hi: कृपया कम से कम एक स्तर चुनें।
id: Silakan pilih setidaknya satu level.
ja: 少なくとも1つのレベルを選択してください。
pt: Por favor, selecione pelo menos um nível.

source: Failed to create game
de: Fehler beim Erstellen des Spiels
es: Error al crear el juego
fr: Échec de la création du jeu
hi: खेल बनाने में विफल
id: Gagal membuat permainan
ja: ゲームの作成に失敗しました
pt: Falha ao criar o jogo

# enterNameAndCode
source: Enter your name and the 6-digit code.
de: Gib deinen Namen und den 6-stelligen Code ein.
es: Ingresa tu nombre y el código de 6 dígitos.
fr: Entrez votre nom et le code à 6 chiffres.
hi: अपना नाम और 6-अंकीय कोड दर्ज करें।
id: Masukkan nama Anda dan kode 6 digit.
ja: 名前と6桁のコードを入力してください。
pt: Digite seu nome e o código de 6 dígitos.

# gameCodeHint
source: e.g. ABC123
de: z.B. ABC123
es: ej. ABC123
fr: ex. ABC123
hi: उदा. ABC123
id: mis. ABC123
ja: 例: ABC123
pt: ex: ABC123

source: Failed to join
de: Beitritt fehlgeschlagen
es: Error al unirse
fr: Échec de la connexion
hi: शामिल होने में विफल
id: Gagal bergabung
ja: 参加に失敗しました
pt: Falha ao entrar

source: Failed to sign in
de: Anmeldung fehlgeschlagen
es: Error al iniciar sesión
fr: Échec de la connexion
hi: साइन इन करने में विफल
id: Gagal masuk
ja: サインインに失敗しました
pt: Falha ao fazer login

source: Leave Game?
de: Spiel Verlassen?
es: ¿Salir del Juego?
fr: Quitter le Jeu?
hi: खेल छोड़ें?
id: Tinggalkan Permainan?
ja: ゲームを退出?
pt: Sair do Jogo?

source: Leave
de: Verlassen
es: Salir
fr: Quitter
hi: छोड़ें
id: Tinggalkan
ja: 退出
pt: Sair

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
id: Batal
ja: キャンセル
pt: Cancelar

source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
hi: पुष्टि करें
id: Konfirmasi
ja: 確認
pt: Confirmar

source: Select Character
de: Charakter Wählen
es: Seleccionar Personaje
fr: Sélectionner le Personnage
hi: पात्र चुनें
id: Pilih Karakter
ja: キャラクターを選択
pt: Selecionar Personagem

# opponentReady
source: Your opponent is ready!
de: Ihr Gegner ist bereit!
es: ¡Tu oponente está listo!
fr: Votre adversaire est prêt!
hi: आपका प्रतिद्वंद्वी तैयार है!
id: Lawan Anda sudah siap!
ja: 対戦相手の準備ができました！
pt: Seu oponente está pronto!

source: Dismiss
de: Ablehnen
es: Descartar
fr: Ignorer
hi: खारिज करें
id: Tutup
ja: 閉じる
pt: Dispensar

source: Game Over
de: Spiel Beendet
es: Fin del Juego
fr: Fin de Partie
hi: खेल समाप्त
id: Permainan Selesai
ja: ゲーム終了
pt: Fim de Jogo

source: ✅ Question sent!
de: ✅ Frage gesendet!
es: ✅ ¡Pregunta enviada!
fr: ✅ Question envoyée !
hi: ✅ प्रश्न भेजा गया!
id: ✅ Pertanyaan terkirim!
ja: ✅ 質問を送信しました！
pt: ✅ Pergunta enviada!

source: ✅ Answer sent!
de: ✅ Antwort gesendet!
es: ✅ ¡Respuesta enviada!
fr: ✅ Réponse envoyée !
hi: ✅ उत्तर भेजा गया!
id: ✅ Jawaban terkirim!
ja: ✅ 回答を送信しました！
pt: ✅ Resposta enviada!

source: ❌ Error
de: ❌ Fehler
fr: ❌ Erreur
hi: ❌ त्रुटि
id: ❌ Kesalahan
ja: ❌ エラー
pt: ❌ Erro

source: 📤 Sending answer
de: 📤 Antwort senden
es: 📤 Enviando respuesta
fr: 📤 Envoi de la réponse
hi: 📤 उत्तर भेज रहे हैं
id: 📤 Mengirim jawaban
ja: 📤 回答を送信中
pt: 📤 Enviando resposta

# opponentLeft
source: Your opponent left the game
de: Ihr Gegner hat das Spiel verlassen
es: Tu oponente abandonó el juego
fr: Votre adversaire a quitté le jeu
hi: आपका प्रतिद्वंद्वी खेल छोड़ गया
id: Lawan Anda meninggalkan permainan
ja: 対戦相手がゲームを退出しました
pt: Seu oponente saiu do jogo

source: Guess the character!
de: Errate den Charakter!
es: ¡Adivina el personaje!
fr: Devinez le personnage!
hi: पात्र का अनुमान लगाएं!
id: Tebak Karakternya!
ja: キャラクターを当てよう！
pt: Adivinhe o Personagem!

# askQuestion
source: Ask a question...
de: Stellen Sie eine Frage...
es: Haz una pregunta...
fr: Posez une question...
hi: एक प्रश्न पूछें...
id: Ajukan pertanyaan...
ja: 質問してください...
pt: Faça uma pergunta...

# noCharacterToGuess
source: No available Character to guess
de: Kein Charakter zum Raten verfügbar
es: No hay personaje disponible para adivinar
fr: Aucun personnage disponible à deviner
hi: अनुमान लगाने के लिए कोई पात्र उपलब्ध नहीं है
id: Tidak ada karakter tersedia untuk ditebak
ja: 推測できるキャラクターがありません
pt: Nenhum personagem disponível para adivinhar

source: Guess
de: Raten
es: Adivinar
fr: Deviner
hi: अनुमान
id: Tebak
ja: 推測
pt: Adivinhar

source: Round Result
de: Rundenergebnis
es: Resultado de la Ronda
fr: Résultat du Tour
hi: राउंड परिणाम
id: Hasil Ronde
ja: ラウンド結果
pt: Resultado da Rodada

source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
id: Bahasa
ja: 言語
pt: Idioma

source: Vibration
es: Vibración
hi: कंपन
id: Getaran
ja: 振動
pt: Vibração

source: Yes
de: Ja
es: Sí
fr: Oui
hi: हाँ
id: Ya
ja: はい
pt: Sim

source: No
de: Nein
fr: Non
hi: नहीं
id: Tidak
ja: いいえ
pt: Não

source: I don't know
de: Ich weiß nicht
es: No sé
fr: Je ne sais pas
hi: मुझे नहीं पता
id: Saya tidak tahu
ja: わかりません
pt: Não sei

# eula
source: End User License Agreement (EULA)
de: Endbenutzer-Lizenzvereinbarung (EULA)
es: Acuerdo de Licencia de Usuario Final (EULA)
fr: Contrat de Licence Utilisateur Final (CLUF)
hi: अंतिम उपयोगकर्ता लाइसेंस समझौता (EULA)
id: Perjanjian Lisensi Pengguna Akhir (EULA)
ja: エンドユーザー使用許諾契約（EULA）
pt: Contrato de Licença de Usuário Final (EULA)

# eulaContent
source: This app is provided under the MIT License. By using this app, you agree to abide by the terms and conditions set forth in the license and any applicable app store requirements.
de: Diese App wird unter der MIT-Lizenz bereitgestellt. Durch die Nutzung dieser App erklären Sie sich damit einverstanden, die in der Lizenz festgelegten Geschäftsbedingungen und alle anwendbaren App-Store-Anforderungen einzuhalten.
es: Esta aplicación se proporciona bajo la Licencia MIT. Al usar esta aplicación, acepta cumplir con los términos y condiciones establecidos en la licencia y cualquier requisito aplicable de la tienda de aplicaciones.
fr: Cette application est fournie sous la Licence MIT. En utilisant cette application, vous acceptez de respecter les termes et conditions énoncés dans la licence et toutes les exigences applicables des magasins d'applications.
hi: यह ऐप MIT लाइसेंस के तहत प्रदान किया गया है। इस ऐप का उपयोग करके, आप लाइसेंस में निर्धारित नियमों और शर्तों और किसी भी लागू ऐप स्टोर आवश्यकताओं का पालन करने के लिए सहमत होते हैं।
id: Aplikasi ini disediakan di bawah Lisensi MIT. Dengan menggunakan aplikasi ini, Anda setuju untuk mematuhi syarat dan ketentuan yang ditetapkan dalam lisensi dan persyaratan toko aplikasi yang berlaku.
ja: このアプリはMITライセンスの下で提供されています。このアプリを使用することにより、ライセンスに定められた利用規約および該当するアプリストアの要件を遵守することに同意したものとみなされます。
pt: Este aplicativo é fornecido sob a Licença MIT. Ao usar este aplicativo, você concorda em cumprir os termos e condições estabelecidos na licença e quaisquer requisitos aplicáveis da loja de aplicativos.

source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de Confidentialité
hi: गोपनीयता नीति
id: Kebijakan Privasi
ja: プライバシーポリシー
pt: Política de Privacidade

source: Terms of Service
de: Nutzungsbedingungen
es: Términos de Servicio
fr: Conditions d'Utilisation
hi: सेवा की शर्तें
id: Ketentuan Layanan
ja: 利用規約
pt: Termos de Serviço

# termsOfServiceContent
source: By using this app, you agree to use it for entertainment purposes only and not for any unlawful activity. See the MIT License for more details.
de: Durch die Nutzung dieser App stimmen Sie zu, sie nur zu Unterhaltungszwecken und nicht für illegale Aktivitäten zu verwenden. Weitere Einzelheiten finden Sie in der MIT-Lizenz.
es: Al usar esta aplicación, acepta usarla solo con fines de entretenimiento y no para ninguna actividad ilegal. Consulte la Licencia MIT para más detalles.
fr: En utilisant cette application, vous acceptez de l'utiliser à des fins de divertissement uniquement et non pour toute activité illégale. Voir la Licence MIT pour plus de détails.
hi: इस ऐप का उपयोग करके, आप इसे केवल मनोरंजन उद्देश्यों के लिए उपयोग करने और अवैध गतिविधियों के लिए नहीं करने के लिए सहमत होते हैं। अधिक जानकारी के लिए MIT लाइसेंस देखें।
id: Dengan menggunakan aplikasi ini, Anda setuju untuk menggunakannya hanya untuk tujuan hiburan dan bukan untuk aktivitas ilegal. Lihat Lisensi MIT untuk detail lebih lanjut.
ja: このアプリを使用することにより、娯楽目的のみに使用し、違法な活動には使用しないことに同意したものとみなされます。詳細については、MITライセンスを参照してください。
pt: Ao usar este aplicativo, você concorda em usá-lo apenas para fins de entretenimento e não para atividades ilegais. Consulte a Licença MIT para mais detalhes.

# digimonTrademarkNotice
source: Digimon and Digimon character names are trademarks of Bandai/Toei Animation.
de: Digimon und die Namen der Digimon-Charaktere sind Marken von Bandai/Toei Animation.
es: Digimon y los nombres de los personajes de Digimon son marcas comerciales de Bandai/Toei Animation.
fr: Digimon et les noms des personnages Digimon sont des marques déposées de Bandai/Toei Animation.
hi: डिजीमॉन और डिजीमॉन पात्रों के नाम बंडाई/तोएी एनिमेशन के ट्रेडमार्क हैं।
id: Digimon dan nama karakter Digimon adalah merek dagang milik Bandai/Toei Animation.
ja: 「デジモン」およびデジモンのキャラクター名はバンダイ/東映アニメーションの商標です。
pt: Digimon e os nomes dos personagens Digimon são marcas comerciais da Bandai/Toei Animation.

# creatingGame
source: Creating a game
de: Ein Spiel erstellen
es: Creando un juego
fr: Création d'une partie
hi: एक खेल बनाना
id: Membuat Permainan
ja: ゲームの作成
pt: Criando um Jogo

# creatingGameDesc
source: 1. Create the game by pressing the "Create Game" button 2. Enter your name and select which levels and how many characters you want to include in the match 3. Generate a game code or QR code to share with your opponent 4. Share with your opponent for them to join
de: 1. Erstelle das Spiel, indem du auf die Schaltfläche "Spiel Erstellen" klickst 2. Gib deinen Namen ein und wähle aus, welche Level und wie viele Charaktere du in das Spiel aufnehmen möchtest 3. Generiere einen Spielcode oder QR-Code zum Teilen mit deinem Gegner 4. Teile ihn mit deinem Gegner, damit er beitreten kann
es: 1. Crea el juego presionando el botón "Crear Juego" 2. Ingresa tu nombre y selecciona qué niveles y cuántos personajes quieres incluir en la partida 3. Genera un código de juego o código QR para compartir con tu oponente 4. Comparte con tu oponente para que se una
fr: 1. Créez le jeu en appuyant sur le bouton "Créer une Partie" 2. Entrez votre nom et sélectionnez quels niveaux et combien de personnages vous voulez inclure dans le match 3. Générez un code de jeu ou un code QR à partager avec votre adversaire 4. Partagez avec votre adversaire pour qu'il rejoigne
hi: 1. 'खेल बनाएं' बटन पर क्लिक करके खेल बनाएं 2. अपना नाम दर्ज करें और चुनें कि आप कौन से स्तर और कितने पात्रों को खेल में शामिल करना चाहते हैं 3. अपने प्रतिद्वंद्वी के साथ साझा करने के लिए एक खेल कोड या QR कोड बनाएं 4. इसे अपने प्रतिद्वंद्वी के साथ साझा करें ताकि वे शामिल हो सकें
id: 1. Buat permainan dengan mengklik tombol 'Buat Permainan' 2. Masukkan nama Anda dan pilih level dan jumlah karakter yang ingin Anda sertakan dalam permainan 3. Buat kode permainan atau kode QR untuk dibagikan dengan lawan Anda 4. Bagikan dengan lawan Anda agar mereka dapat bergabung
ja: 1. "ゲームを作成"ボタンを押してゲームを作成します 2. 名前を入力し、マッチに含めるレベルとキャラクター数を選択します 3. 対戦相手と共有するためのゲームコードまたはQRコードを生成します 4. 対戦相手と共有して参加してもらいます
pt: 1. Crie o jogo clicando no botão 'Criar Jogo' 2. Digite seu nome e escolha quais níveis e quantos personagens deseja incluir no jogo 3. Gere um código de jogo ou código QR para compartilhar com seu oponente 4. Compartilhe com seu oponente para que ele possa entrar

# joiningGame
source: Joining a game
de: Einem Spiel beitreten
es: Uniéndose a un juego
fr: Rejoindre une partie
hi: एक खेल में शामिल होना
id: Bergabung ke Permainan
ja: ゲームへの参加
pt: Entrando em um Jogo

# joiningGameDesc
source: 1. Join a game by pressing the "Join Game" button 2. Enter your name and the game code or scan the QR code 3. Choose your character
de: 1. Tritt einem Spiel bei, indem du auf die Schaltfläche "Spiel Beitreten" klickst 2. Gib deinen Namen und den Spielcode ein oder scanne den QR-Code 3. Wähle deinen Charakter
es: 1. Únete a un juego presionando el botón "Unirse al Juego" 2. Ingresa tu nombre y el código del juego o escanea el código QR 3. Elige tu personaje
fr: 1. Rejoignez un jeu en appuyant sur le bouton "Rejoindre une Partie" 2. Entrez votre nom et le code du jeu ou scannez le code QR 3. Choisissez votre personnage
hi: 1. 'खेल में शामिल हों' बटन पर क्लिक करके खेल में शामिल हों 2. अपना नाम और खेल कोड दर्ज करें या QR कोड स्कैन करें 3. अपना पात्र चुनें
id: 1. Gabung permainan dengan mengklik tombol 'Gabung Permainan' 2. Masukkan nama Anda dan kode permainan atau pindai kode QR 3. Pilih karakter Anda
ja: 1. "ゲームに参加"ボタンを押してゲームに参加します 2. 名前とゲームコードを入力するか、QRコードをスキャンします 3. キャラクターを選択します
pt: 1. Entre em um jogo clicando no botão 'Entrar no Jogo' 2. Digite seu nome e o código do jogo ou escaneie o código QR 3. Selecione seu personagem

# playingGame
source: Playing the game
de: Das Spiel spielen
es: Jugando el juego
fr: Jouer au jeu
hi: खेल खेलना
id: Bermain
ja: ゲームのプレイ
pt: Jogando o Jogo

# playingGameDesc
source: 1. A coin flip is decided as to who goes first 2. Take turns asking yes/no questions using the chat interface 3. Eliminate characters based on the answers 4. Guess which character your opponent has chosen before they guess yours!
de: 1. Ein Münzwurf entscheidet, wer anfängt 2. Stellt abwechselnd Ja/Nein-Fragen über die Chat-Oberfläche 3. Eliminiere Charaktere basierend auf den Antworten 4. Errate, welchen Charakter dein Gegner gewählt hat, bevor er deinen erraten kann!
es: 1. Se decide con un lanzamiento de moneda quién va primero 2. Túrnense para hacer preguntas de sí/no usando la interfaz de chat 3. Elimina personajes según las respuestas 4. ¡Adivina qué personaje eligió tu oponente antes de que adivine el tuyo!
fr: 1. Un lancer de pièce décide qui commence 2. Posez des questions oui/non à tour de rôle en utilisant l'interface de chat 3. Éliminez les personnages en fonction des réponses 4. Devinez quel personnage votre adversaire a choisi avant qu'il ne devine le vôtre !
hi: 1. एक सिक्का उछाल तय करती है कि कौन शुरू करता है 2. चैट इंटरफ़ेस के माध्यम से बारी-बारी से हां/नहीं प्रश्न पूछें 3. उत्तरों के आधार पर पात्रों को हटाएं 4. अपने प्रतिद्वंद्वी से पहले अनुमान लगाएं कि उसने कौन सा पात्र चुना है!
id: 1. Lemparan koin menentukan siapa yang mulai 2. Bergantian mengajukan pertanyaan ya/tidak melalui antarmuka obrolan 3. Eliminasi karakter berdasarkan jawaban 4. Tebak karakter yang dipilih lawan Anda sebelum dia menebak milik Anda!
ja: 1. コイントスでどちらが先攻か決まります 2. チャットインターフェースを使用して交代ではい/いいえの質問をします 3. 回答に基づいてキャラクターを除外します 4. 相手があなたのキャラクターを推測する前に、相手が選んだキャラクターを推測しましょう！
pt: 1. Um lançamento de moeda decide quem começa 2. Alternem fazendo perguntas de sim/não pela interface de chat 3. Elimine personagens com base nas respostas 4. Adivinhe qual personagem seu oponente escolheu antes que ele adivinhe o seu!

# privacyPolicyTitle
source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de Confidentialité
hi: गोपनीयता नीति
id: Kebijakan Privasi
ja: プライバシーポリシー
pt: Política de Privacidade

# privacyPolicyIntro
source: This app uses Firebase services to provide multiplayer features and store game data. We may collect basic information such as usernames, game progress, and device information for the purpose of gameplay and improving the app. No personal information is sold or shared with third parties except as required by Firebase or by law.
de: Diese App verwendet Firebase-Dienste, um Multiplayer-Funktionen bereitzustellen und Spieldaten zu speichern. Wir können grundlegende Informationen wie Benutzernamen, Spielfortschritt und Geräteinformationen zum Zwecke des Spiels und zur Verbesserung der App sammeln. Persönliche Informationen werden nicht verkauft oder an Dritte weitergegeben, außer wie von Firebase oder gesetzlich vorgeschrieben.
es: Esta aplicación utiliza servicios de Firebase para proporcionar funciones multijugador y almacenar datos del juego. Podemos recopilar información básica como nombres de usuario, progreso del juego e información del dispositivo con el propósito del juego y mejorar la aplicación. No se vende ni comparte información personal con terceros excepto según lo requiera Firebase o la ley.
fr: Cette application utilise les services Firebase pour fournir des fonctionnalités multijoueurs et stocker les données de jeu. Nous pouvons collecter des informations de base telles que les noms d'utilisateur, la progression du jeu et les informations sur l'appareil dans le but du jeu et d'améliorer l'application. Aucune information personnelle n'est vendue ou partagée avec des tiers sauf selon les exigences de Firebase ou de la loi.
hi: यह ऐप मल्टीप्लेयर कार्यक्षमता प्रदान करने और खेल डेटा स्टोर करने के लिए Firebase सेवाओं का उपयोग करता है। हम खेल उद्देश्यों और ऐप सुधार के लिए उपयोगकर्ता नाम, खेल प्रगति और डिवाइस जानकारी जैसी बुनियादी जानकारी एकत्र कर सकते हैं। व्यक्तिगत जानकारी Firebase द्वारा आवश्यक या कानून द्वारा आवश्यक के अलावा तीसरे पक्ष को बेची या साझा नहीं की जाती है।
id: Aplikasi ini menggunakan layanan Firebase untuk menyediakan fungsi multipemain dan menyimpan data permainan. Kami dapat mengumpulkan informasi dasar seperti nama pengguna, kemajuan permainan, dan informasi perangkat untuk tujuan permainan dan peningkatan aplikasi. Informasi pribadi tidak dijual atau dibagikan kepada pihak ketiga kecuali sebagaimana diperlukan oleh Firebase atau hukum.
ja: このアプリはFirebaseサービスを使用してマルチプレイヤー機能を提供し、ゲームデータを保存します。ゲームプレイとアプリの改善のために、ユーザー名、ゲームの進行状況、デバイス情報などの基本情報を収集する場合があります。Firebaseまたは法律で必要とされる場合を除き、個人情報が第三者に販売または共有されることはありません。
pt: Este aplicativo usa serviços Firebase para fornecer funcionalidade multijogador e armazenar dados do jogo. Podemos coletar informações básicas como nomes de usuário, progresso do jogo e informações do dispositivo para fins de jogo e melhoria do aplicativo. Informações pessoais não são vendidas ou compartilhadas com terceiros, exceto conforme exigido pelo Firebase ou por lei.

source: Data Collected:
de: Gesammelte Daten:
es: Datos Recopilados:
fr: Données Collectées :
hi: एकत्रित डेटा:
id: Data yang Dikumpulkan:
ja: 収集されるデータ：
pt: Dados Coletados:

# dataCollectedList
source: - Usernames and game codes - Game progress and scores - Device information (for analytics/debugging)
de: - Benutzernamen und Spielcodes - Spielfortschritt und Punktzahlen - Geräteinformationen (für Analysen/Fehlerbehebung)
es: - Nombres de usuario y códigos de juego - Progreso y puntuaciones del juego - Información del dispositivo (para análisis/depuración)
fr: - Noms d'utilisateur et codes de jeu - Progression et scores du jeu - Informations sur l'appareil (pour l'analyse/débogage)
hi: - उपयोगकर्ता नाम और खेल कोड - खेल प्रगति और स्कोर - डिवाइस जानकारी (विश्लेषण/समस्या निवारण के लिए)
id: - Nama pengguna dan kode permainan - Kemajuan permainan dan skor - Informasi perangkat (untuk analitik/pemecahan masalah)
ja: - ユーザー名とゲームコード - ゲームの進行状況とスコア - デバイス情報（分析/デバッグ用）
pt: - Nomes de usuário e códigos de jogo - Progresso do jogo e pontuações - Informações do dispositivo (para análise/solução de problemas)

source: How We Use Data:
de: Wie Wir Daten Verwenden:
es: Cómo Usamos los Datos:
fr: Comment Nous Utilisons les Données :
hi: हम डेटा का उपयोग कैसे करते हैं:
id: Cara Kami Menggunakan Data:
ja: データの使用方法：
pt: Como Usamos os Dados:
