Repository: ben456789/digi-guess-head-2-head
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, hi, id, ja, pt

# howWeUseDataList
source: - To enable multiplayer gameplay - To save your progress - To improve app performance and stability
de: - Um Multiplayer-Gameplay zu ermöglichen - Um deinen Fortschritt zu speichern - Um die Leistung und Stabilität der App zu verbessern
es: - Para habilitar el juego multijugador - Para guardar tu progreso - Para mejorar el rendimiento y estabilidad de la aplicación
fr: - Pour activer le jeu multijoueur - Pour enregistrer votre progression - Pour améliorer les performances et la stabilité de l'application
hi: - मल्टीप्लेयर गेमप्ले को सक्षम करने के लिए - आपकी प्रगति को सहेजने के लिए - ऐप प्रदर्शन और स्थिरता में सुधार करने के लिए
id: - Untuk mengaktifkan gameplay multipemain - Untuk menyimpan kemajuan Anda - Untuk meningkatkan kinerja dan stabilitas aplikasi
ja: - マルチプレイヤーゲームプレイを有効にするため - 進行状況を保存するため - アプリのパフォーマンスと安定性を向上させるため
pt: - Para permitir jogabilidade multijogador - Para salvar seu progresso - Para melhorar o desempenho e estabilidade do aplicativo

source: Third-Party Services:
de: Drittanbieterdienste:
es: Servicios de Terceros:
fr: Services Tiers :
hi: तृतीय-पक्ष सेवाएं:
id: Layanan Pihak Ketiga:
ja: サードパーティサービス：
pt: Serviços de Terceiros:

# thirdPartyServicesDesc
source: We use Google Firebase for authentication, database, and analytics. Please refer to Firebase's privacy policy for more details.
de: Wir verwenden Google Firebase für Authentifizierung, Datenbank und Analysen. Bitte lesen Sie die Datenschutzrichtlinie von Firebase für weitere Details.
es: Usamos Google Firebase para autenticación, base de datos y análisis. Consulte la política de privacidad de Firebase para más detalles.
fr: Nous utilisons Google Firebase pour l'authentification, la base de données et l'analyse. Veuillez consulter la politique de confidentialité de Firebase pour plus de détails.
hi: हम प्रमाणीकरण, डेटाबेस और विश्लेषण के लिए Google Firebase का उपयोग करते हैं। अधिक जानकारी के लिए कृपया Firebase की गोपनीयता नीति पढ़ें।
id: Kami menggunakan Google Firebase untuk autentikasi, database, dan analitik. Harap baca kebijakan privasi Firebase untuk detail lebih lanjut.
ja: 認証、データベース、分析にはGoogle Firebaseを使用しています。詳細についてはFirebaseのプライバシーポリシーを参照してください。
pt: Usamos o Google Firebase para autenticação, banco de dados e análises. Por favor, leia a política de privacidade do Firebase para mais detalhes.

source: Contact:
de: Kontakt:
es: Contacto:
hi: संपर्क:
id: Kontak:
ja: お問い合わせ：
pt: Contato:

# contactDesc
source: If you have questions about privacy, contact the developer.
de: Wenn Sie Fragen zum Datenschutz haben, kontaktieren Sie den Entwickler.
es: Si tiene preguntas sobre privacidad, contacte al desarrollador.
fr: Si vous avez des questions sur la confidentialité, contactez le développeur.
hi: यदि आपके गोपनीयता के बारे में प्रश्न हैं, तो डेवलपर से संपर्क करें।
id: Jika Anda memiliki pertanyaan tentang privasi, hubungi pengembang.
ja: プライバシーに関する質問がある場合は、開発者にお問い合わせください。
pt: Se você tiver perguntas sobre privacidade, entre em contato com o desenvolvedor.

source: Copy Code
de: Code Kopieren
es: Copiar Código
fr: Copier le Code
hi: कोड कॉपी करें
id: Salin Kode
ja: コードをコピー
pt: Copiar Código

# codeCopied
source: Game code copied to clipboard!
de: Spielcode in die Zwischenablage kopiert!
es: ¡Código del juego copiado al portapapeles!
fr: Code de jeu copié dans le presse-papiers !
hi: खेल कोड क्लिपबोर्ड पर कॉपी किया गया!
id: Kode permainan disalin ke papan klip!
ja: ゲームコードがクリップボードにコピーされました！
pt: Código do jogo copiado para a área de transferência!

# gameNotFound
source: Game not found. Please check the code.
de: Spiel nicht gefunden. Bitte überprüfen Sie den Code.
es: Juego no encontrado. Por favor verifica el código.
fr: Jeu introuvable. Veuillez vérifier le code.
hi: खेल नहीं मिला। कृपया कोड जांचें।
id: Permainan tidak ditemukan. Silakan periksa kode.
ja: ゲームが見つかりません。コードを確認してください。
pt: Jogo não encontrado. Por favor, verifique o código.

source: Scan QR Code
de: QR-Code Scannen
es: Escanear Código QR
fr: Scanner le Code QR
hi: QR कोड स्कैन करें
id: Pindai Kode QR
ja: QRコードをスキャン
pt: Escanear Código QR

source: Joining...
de: Beitritt...
es: Uniéndose...
fr: Connexion...
hi: शामिल हो रहे हैं...
id: Bergabung...
ja: 参加中...
pt: Entrando...

# gen
source: Level
es: Nivel
fr: Niveau
hi: स्तर
ja: レベル
pt: Nível

# createGameTitle
source: Create Game
de: Spiel Erstellen
es: Crear Juego
fr: Créer une Partie
hi: खेल बनाएं
id: Buat Permainan
ja: ゲーム作成
pt: Criar Jogo

# createGameHeading
source: Create game
de: Spiel erstellen
es: Crear juego
fr: Créer une partie
hi: खेल बनाएं
id: Buat permainan
ja: ゲームを作成
pt: Criar jogo

# createGameDescription
source: Enter your name to generate a 6-digit code and QR for your friend to join.
de: Geben Sie Ihren Namen ein, um einen 6-stelligen Code und einen QR-Code zu generieren, damit Ihr Freund beitreten kann.
es: Ingresa tu nombre para generar un código de 6 dígitos y un QR para que tu amigo se una.
fr: Entrez votre nom pour générer un code à 6 chiffres et un QR pour que votre ami puisse rejoindre.
hi: अपने मित्र के शामिल होने के लिए 6-अंकीय कोड और QR कोड बनाने के लिए अपना नाम दर्ज करें।
id: Masukkan nama Anda untuk membuat kode 6 digit dan kode QR agar teman Anda dapat bergabung.
ja: 名前を入力して、友達が参加できる6桁のコードとQRを生成してください。
pt: Digite seu nome para gerar um código de 6 dígitos e um código QR para seu amigo entrar.

# waitingForFriend
source: Waiting for friend to join...
de: Warten auf Freund...
es: Esperando a que tu amigo se una...
fr: En attente de votre ami...
hi: मित्र की प्रतीक्षा में...
id: Menunggu teman...
ja: 友達の参加を待っています...
pt: Aguardando amigo...

# friendCanScanQR
source: Friend can scan this QR or enter the code to join.
de: Ihr Freund kann diesen QR-Code scannen oder den Code eingeben, um beizutreten.
es: Tu amigo puede escanear este QR o ingresar el código para unirse.
fr: Votre ami peut scanner ce QR ou entrer le code pour rejoindre.
hi: आपका मित्र इस QR कोड को स्कैन कर सकता है या शामिल होने के लिए कोड दर्ज कर सकता है।
id: Teman Anda dapat memindai kode QR ini atau memasukkan kode untuk bergabung.
ja: 友達はこのQRをスキャンするか、コードを入力して参加できます。
pt: Seu amigo pode escanear este código QR ou digitar o código para entrar.

source: Join a friend
de: Einem Freund beitreten
es: Unirse a un amigo
fr: Rejoindre un ami
hi: एक मित्र के साथ शामिल हों
id: Gabung dengan Teman
ja: 友達に参加
pt: Entrar com um Amigo

# enterNameAndCodeOrScan
source: Enter your name and the 6-digit code, or scan their QR.
de: Geben Sie Ihren Namen und den 6-stelligen Code ein oder scannen Sie deren QR.
es: Ingresa tu nombre y el código de 6 dígitos, o escanea su QR.
fr: Entrez votre nom et le code à 6 chiffres, ou scannez leur QR.
hi: अपना नाम और 6-अंकीय कोड दर्ज करें या उनके QR को स्कैन करें।
id: Masukkan nama Anda dan kode 6 digit atau pindai QR mereka.
ja: 名前と6桁のコードを入力するか、QRをスキャンしてください。
pt: Digite seu nome e o código de 6 dígitos ou escaneie o QR dele.

source: Game code
de: Spielcode
es: Código del juego
fr: Code du jeu
hi: खेल कोड
id: Kode Permainan
ja: ゲームコード
pt: Código do Jogo

# gameCodeExample
source: e.g. ABC123
de: z.B. ABC123
es: ej. ABC123
fr: ex. ABC123
hi: उदा. ABC123
id: mis. ABC123
ja: 例: ABC123
pt: ex: ABC123

# qrScanningNotAvailableWeb
source: QR scanning is not available on web. Please enter the code manually.
de: QR-Scannen ist im Web nicht verfügbar. Bitte geben Sie den Code manuell ein.
es: El escaneo QR no está disponible en web. Por favor, ingresa el código manualmente.
fr: Le scan QR n'est pas disponible sur le web. Veuillez entrer le code manuellement.
hi: वेब पर QR स्कैनिंग उपलब्ध नहीं है। कृपया कोड मैन्युअल रूप से दर्ज करें।
id: Pemindaian QR tidak tersedia di web. Silakan masukkan kode secara manual.
ja: QRスキャンはウェブでは利用できません。手動でコードを入力してください。
pt: Escaneamento de QR não está disponível na web. Por favor, digite o código manualmente.

# gameNotFoundCheckCode
source: Game not found. Please check the code.
de: Spiel nicht gefunden. Bitte überprüfen Sie den Code.
es: Juego no encontrado. Por favor, verifica el código.
fr: Jeu introuvable. Veuillez vérifier le code.
hi: खेल नहीं मिला। कृपया कोड जांचें।
id: Permainan tidak ditemukan. Silakan periksa kode.
ja: ゲームが見つかりません。コードを確認してください。
pt: Jogo não encontrado. Por favor, verifique o código.

source: Failed to join: {error}
de: Beitritt fehlgeschlagen: {error}
es: Error al unirse: {error}
fr: Échec de rejoindre: {error}
hi: शामिल होने में विफल: {error}
id: Gagal bergabung: {error}
ja: 参加に失敗しました: {error}
pt: Falha ao entrar: {error}

# leaveGameConfirmation
source: Are you sure you want to leave? The game will be terminated.
de: Möchten Sie wirklich gehen? Das Spiel wird beendet.
es: ¿Estás seguro de que quieres salir? El juego será terminado.
fr: Êtes-vous sûr de vouloir partir? La partie sera terminée.
hi: क्या आप वाकई छोड़ना चाहते हैं? खेल समाप्त हो जाएगा।
id: Apakah Anda yakin ingin pergi? Permainan akan diakhiri.
ja: 本当に退出しますか？ゲームは終了されます。
pt: Tem certeza que deseja sair? O jogo será encerrado.

# playingAgainst
source: Playing against: {opponentName}
de: Spielen gegen: {opponentName}
es: Jugando contra: {opponentName}
fr: Jouer contre: {opponentName}
hi: इसके खिलाफ खेल रहे हैं: {opponentName}
id: Bermain melawan: {opponentName}
ja: 対戦相手: {opponentName}
pt: Jogando contra: {opponentName}

# generationsInGame
source: Levels in this game:
de: Level in diesem Spiel:
es: Niveles en este juego:
fr: Niveaux dans ce jeu:
hi: इस खेल में स्तर:
id: Level dalam permainan ini:
ja: このゲームのレベル:
pt: Níveis neste jogo:

source: Your Character
de: Ihr Charakter
es: Tu Personaje
fr: Votre Personnage
hi: आपका पात्र
id: Karakter Anda
ja: あなたのキャラクター
pt: Seu Personagem

source: Chat
hi: चैट
id: Obrolan
ja: チャット

source: Your turn to answer
de: Sie sind dran zu antworten
es: Tu turno de responder
fr: Votre tour de répondre
hi: आपकी बारी उत्तर देने की
id: Giliran Anda menjawab
ja: あなたの答える番
pt: Sua vez de responder

source: Your turn to ask
de: Sie sind dran zu fragen
es: Tu turno de preguntar
fr: Votre tour de demander
hi: आपकी बारी पूछने की
id: Giliran Anda bertanya
ja: あなたの質問する番
pt: Sua vez de perguntar

source: Waiting for answer
de: Warte auf Antwort
es: Esperando respuesta
fr: En attente de réponse
hi: उत्तर की प्रतीक्षा में
id: Menunggu jawaban
ja: 答えを待っています
pt: Aguardando resposta

source: Waiting for question
de: Warte auf Frage
es: Esperando pregunta
fr: En attente de question
hi: प्रश्न की प्रतीक्षा में
id: Menunggu pertanyaan
ja: 質問を待っています
pt: Aguardando pergunta

source: Hide Eliminated
de: Eliminierte Ausblenden
es: Ocultar Eliminados
fr: Masquer Éliminés
hi: समाप्त किए गए छुपाएं
id: Sembunyikan dihilangkan
ja: 除外を非表示
pt: Ocultar Eliminados

# charactersRemaining
source: {opponentName} has {count} characters remaining
de: {opponentName} hat {count} Charaktere übrig
es: {opponentName} tiene {count} personajes restantes
fr: {opponentName} a {count} personnages restants
hi: {opponentName} के पास {count} पात्र शेष हैं
id: {opponentName} memiliki {count} karakter tersisa
ja: {opponentName}は{count}体のキャラクターが残っています
pt: {opponentName} tem {count} personagens restantes

# noAvailableCharacter
source: No available Character to guess
de: Kein verfügbarer Charakter zum Raten
es: No hay personajes disponibles para adivinar
fr: Aucun personnage disponible à deviner
hi: अनुमान लगाने के लिए कोई पात्र उपलब्ध नहीं है
id: Tidak ada karakter tersedia untuk ditebak
ja: 推測できるキャラクターがありません
pt: Nenhum personagem disponível para adivinhar

source: Make a Guess!
de: Raten Sie!
es: ¡Haz una Suposición!
fr: Faites une Supposition!
hi: अनुमान लगाएं!
id: Buat Tebakan!
ja: 推測してください！
pt: Faça um Palpite!

# confirmGuess
source: Are you sure you want to guess {pokemonName}?
de: Möchten Sie wirklich {digimonName} raten?
es: ¿Estás seguro de que quieres adivinar {pokemonName}?
fr: Êtes-vous sûr de vouloir deviner {digimonName}?
hi: क्या आप वाकई {digimonName} का अनुमान लगाना चाहते हैं?
id: Apakah Anda yakin ingin menebak {digimonName}?
ja: {digimonName}を推測しますか？
pt: Tem certeza que deseja adivinhar {digimonName}?

source: No messages yet...
de: Noch keine Nachrichten...
es: Aún no hay mensajes...
fr: Pas encore de messages...
hi: अभी तक कोई संदेश नहीं...
id: Belum ada pesan...
ja: まだメッセージがありません...
pt: Ainda sem mensagens...

# eliminateReminder
source: Don't forget to eliminate characters! They can be found at the end of the list (Unless Hidden).
de: Vergessen Sie nicht, Charaktere zu eliminieren! Sie befinden sich am Ende der Liste (Es sei denn, sie sind ausgeblendet).
es: ¡No olvides eliminar personajes! Se encuentran al final de la lista (A menos que estén ocultos).
fr: N'oubliez pas d'éliminer les personnages! Ils se trouvent à la fin de la liste (Sauf si masqués).
hi: पात्रों को समाप्त करना न भूलें! वे सूची के अंत में हैं (जब तक कि छुपाए न गए हों)।
id: Jangan lupa mengeliminasi karakter! Mereka ada di akhir daftar (Kecuali disembunyikan).
ja: キャラクターを除外することを忘れないでください！リストの最後にあります（非表示にしていない限り）。
pt: Não se esqueça de eliminar personagens! Eles estão no final da lista (A menos que estejam ocultos).

# opponentTyping
source: Opponent is typing...
de: Gegner tippt...
es: El oponente está escribiendo...
fr: L'adversaire écrit...
hi: प्रतिद्वंद्वी टाइप कर रहा है...
id: Lawan sedang mengetik...
ja: 対戦相手が入力中...
pt: Oponente digitando...

source: Send Question
de: Frage Senden
es: Enviar Pregunta
fr: Envoyer la Question
hi: प्रश्न भेजें
id: Kirim Pertanyaan
ja: 質問を送信
pt: Enviar Pergunta

source: Guess Character
de: Charakter Raten
es: Adivinar Personaje
fr: Deviner le Personnage
hi: पात्र का अनुमान लगाएं
id: Tebak Karakter
ja: キャラクターを推測
pt: Adivinhar Personagem

# waitingForAnswerEllipsis
source: Waiting for answer...
de: Warte auf Antwort...
es: Esperando respuesta...
fr: En attente de réponse...
hi: उत्तर की प्रतीक्षा में...
id: Menunggu jawaban...
ja: 答えを待っています...
pt: Aguardando resposta...

# waitingForQuestionEllipsis
source: Waiting for question...
de: Warte auf Frage...
es: Esperando pregunta...
fr: En attente de question...
hi: प्रश्न की प्रतीक्षा में...
id: Menunggu pertanyaan...
ja: 質問を待っています...
pt: Aguardando pergunta...

source: Don't know
de: Weiß ich nicht
es: No sé
fr: Je ne sais pas
hi: मुझे नहीं पता
id: Tidak tahu
ja: わかりません
pt: Não sei

source: You go first!
de: Sie fangen an!
es: ¡Tú vas primero!
fr: Vous commencez!
hi: आप पहले जाएं!
id: Anda mulai duluan!
ja: あなたが先攻！
pt: Você começa!

# playerGoesFirst
source: {playerName} goes first!
de: {playerName} fängt an!
es: ¡{playerName} va primero!
fr: {playerName} commence!
hi: {playerName} पहले जाते हैं!
id: {playerName} mulai duluan!
ja: {playerName}が先攻！
pt: {playerName} começa!

source: CORRECT!
de: RICHTIG!
es: ¡CORRECTO!
hi: सही!
id: BENAR!
ja: 正解！
pt: CORRETO!

source: TIME'S UP!
de: ZEIT IST UM!
es: ¡SE ACABÓ EL TIEMPO!
fr: TEMPS ÉCOULÉ!
hi: समय समाप्त!
id: WAKTU HABIS!
ja: タイムアップ！
pt: TEMPO ESGOTADO!

source: INCORRECT!
de: FALSCH!
es: ¡INCORRECTO!
hi: गलत!
id: SALAH!
ja: 不正解！
pt: INCORRETO!

source: Next round starting...
de: Nächste Runde beginnt...
es: Comenzando siguiente ronda...
fr: Prochain tour commence...
hi: अगला राउंड शुरू हो रहा है...
id: Ronde berikutnya dimulai...
ja: 次のラウンドが始まります...
pt: Próxima rodada começando...

source: Starting new round...
de: Neue Runde wird gestartet...
es: Iniciando nueva ronda...
fr: Démarrage d'un nouveau tour...
hi: नया राउंड शुरू हो रहा है...
id: Memulai ronde baru...
ja: 新しいラウンドを開始しています...
pt: Iniciando nova rodada...

source: 🎉 YOU WIN! 🎉
de: 🎉 SIE GEWINNEN! 🎉
es: 🎉 ¡GANASTE! 🎉
fr: 🎉 VOUS GAGNEZ! 🎉
hi: 🎉 आप जीत गए! 🎉
id: 🎉 ANDA MENANG! 🎉
ja: 🎉 あなたの勝ち！ 🎉
pt: 🎉 VOCÊ VENCEU! 🎉

# youSuccessfullyGuessed
source: You successfully guessed your opponent's Character!
de: Sie haben den Charakter Ihres Gegners erfolgreich erraten!
es: ¡Adivinaste correctamente el Personaje de tu oponente!
fr: Vous avez deviné le Personnage de votre adversaire avec succès!
hi: आपने अपने प्रतिद्वंद्वी के पात्र का सफलतापूर्वक अनुमान लगाया!
id: Anda berhasil menebak karakter lawan!
ja: 相手のキャラクターを正しく推測しました！
pt: Você adivinhou com sucesso o personagem do seu oponente!

# opponentWins
source: {opponentName} wins
de: {opponentName} gewinnt
es: {opponentName} gana
fr: {opponentName} gagne
hi: {opponentName} जीतता है
id: {opponentName} menang
ja: {opponentName}の勝ち
pt: {opponentName} vence

# opponentGuessedCorrectly
source: {opponentName} guessed your Character correctly!
de: {opponentName} hat Ihren Charakter richtig erraten!
es: ¡{opponentName} adivino tu Personaje correctamente!
fr: {opponentName} a deviné votre Personnage correctement!
hi: {opponentName} ने आपके पात्र का सही अनुमान लगाया!
id: {opponentName} menebak karakter Anda dengan benar!
ja: {opponentName}があなたのキャラクターを正しく推測しました！
pt: {opponentName} adivinhou seu personagem corretamente!

source: Characters Selected:
de: Ausgewählte Charaktere:
es: Personajes Seleccionados:
fr: Personnages Sélectionnés:
hi: चयनित पात्र:
id: Karakter yang dipilih:
ja: 選択されたキャラクター：
pt: Personagens selecionados:

source: Score
de: Punkte
es: Puntuación
hi: स्कोर
id: Skor
ja: スコア
pt: Pontuação

# wantsToPlayAgain
source: {playerName} wants to play again!
de: {playerName} möchte noch einmal spielen!
es: ¡{playerName} quiere jugar de nuevo!
fr: {playerName} veut rejouer!
hi: {playerName} फिर से खेलना चाहते हैं!
id: {playerName} ingin bermain lagi!
ja: {playerName}がもう一度プレイしたいです！
pt: {playerName} quer jogar novamente!

source: Waiting for opponent to play again...
de: Warte darauf, dass der Gegner erneut spielt...
es: Esperando a que el oponente juegue de nuevo...
fr: En attente que l'adversaire rejoue...
hi: प्रतिद्वंद्वी के फिर से खेलने की प्रतीक्षा में...
id: Menunggu lawan untuk bermain lagi...
ja: 相手がもう一度プレイするのを待っています...
pt: Aguardando o oponente jogar novamente...

# waitingForOpponentEllipsis
source: Waiting for opponent...
de: Warte auf Gegner...
es: Esperando al oponente...
fr: En attente de l'adversaire...
hi: प्रतिद्वंद्वी की प्रतीक्षा में...
id: Menunggu lawan...
ja: 相手を待っています...
pt: Aguardando oponente...

source: Play again
de: Nochmal spielen
es: Jugar de nuevo
fr: Rejouer
hi: फिर से खेलें
id: Main Lagi
ja: もう一度プレイ
pt: Jogar Novamente

# evolutionChain
source: Evolutions
de: Entwicklungen
es: Evoluciones
fr: Évolutions
hi: विकास
id: Evolusi
ja: 進化
pt: Evoluções

source: Type
de: Typ
es: Tipo
hi: प्रकार
id: Tipe
ja: タイプ
pt: Tipo

# guessQuestion
source: Is it {pokemonName}?
de: Ist es {digimonName}?
es: ¿Es {pokemonName}?
fr: Est-ce {digimonName} ?
hi: क्या यह {digimonName} है?
id: Apakah itu {digimonName}?
ja: それは{digimonName}ですか？
pt: É {digimonName}?

# eulaTitle
source: EULA
fr: CLUF
